Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/how-to-contribute_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: how-to-contribute title: How to Contribute layout: contributing permalink: docs/how-to-contribute.html next: codebase-overview.html redirect_from:
ja: --- id: how-to-contribute title: 貢献の方法 layout: contributing permalink: docs/how-to-contribute.html next: codebase-overview.html redirect_from:

source: React is one of Facebook's first open source projects that is both under very active development and is also being used to ship code to everybody on [facebook.com](https://www.facebook.com).
ja: React は Facebook の最初のオープンソースプロジェクトの 1 つで現在も非常に活発に開発されており、[facebook.com](https://www.facebook.com) 上のあらゆる人々にコードを届けることにも使用されています。

source: We're still working out the kinks to make contributing to this project as easy and transparent as possible, but we're not quite there yet.
ja: 私たちはこのプロジェクトへの貢献をできるだけ簡単かつ透明性の高いものにするために努力していますが、まだ完全ではありません。

source: Hopefully this document makes the process for contributing clear and answers some questions that you may have.
ja: このドキュメントがプロジェクトへの貢献の手順を明確にし、あなたの持つ疑問を解決できれば幸いです。

source: ### [Code of Conduct](https://github.com/facebook/react/blob/main/CODE_OF_CONDUCT.md) {#code-of-conduct}
ja: ### [行動規範](https://github.com/facebook/react/blob/master/CODE_OF_CONDUCT.md) {#code-of-conduct}

source: Facebook has adopted the [Contributor Covenant](https://www.contributor-covenant.org/) as its Code of Conduct, and we expect project participants to adhere to it.
ja: Facebook は行動規範として [Contributor Covenant](https://www.contributor-covenant.org/) を採用しており、プロジェクト参加者が遵守することを期待しています。

source: Please read [the full text](https://github.com/facebook/react/blob/main/CODE_OF_CONDUCT.md) so that you can understand what actions will and will not be tolerated.
ja: [全文](https://code.facebook.com/codeofconduct)を読んでください、そうすれば参加者はどのような行動を取ればよいか、またどのような行動が許容されないのか理解できるでしょう。

source: ### Open Development {#open-development}
ja: ### オープンな開発 {#open-development}

source: All work on React happens directly on [GitHub](https://github.com/facebook/react).
ja: React に関する開発作業はすべて [GitHub](https://github.com/facebook/react) 上で直接行われます。

source: Both core team members and external contributors send pull requests which go through the same review process.
ja: コアチームメンバーと外部のコントリビューターの両方が、同じレビュープロセスを経由するプルリクエストを送ります。

source: ### Semantic Versioning {#semantic-versioning}
ja: ### セマンティック・バージョニング {#semantic-versioning}

source: React follows [semantic versioning](https://semver.org/).
ja: React は[セマンティック・バージョニング](http://semver.org/)に従います。

source: We release patch versions for critical bugfixes, minor versions for new features or non-essential changes, and major versions for any breaking changes.
ja: 重要なバグ修正のためにパッチバージョンを、新機能や非本質的な変更のためにマイナーバージョンを、そして破壊的変更のためにメジャーバージョンをリリースします。

source: When we make breaking changes, we also introduce deprecation warnings in a minor version so that our users learn about the upcoming changes and migrate their code in advance.
ja: 私たちが破壊的変更を加える場合、ユーザが今後の変更について前もって知り、コードを移行できるようにするため、私たちはマイナーバージョンで非推奨警告を行います。

source: Learn more about our commitment to stability and incremental migration in [our versioning policy](/docs/faq-versioning.html).
ja: 我々の安定性および逐次的なマイグレーションに関する取り決めについては、[バージョニングポリシー](/docs/faq-versioning.html)をご覧ください。

source: Every significant change is documented in the [changelog file](https://github.com/facebook/react/blob/main/CHANGELOG.md).
ja: 私たちは全てのプルリクエストにラベルを付けます。ラベルは、行われる変更が[パッチ](https://github.com/facebook/react/pulls?q=is:open+is:pr+label:semver-patch)、[マイナー](https://github.com/facebook/react/pulls?q=is:open+is:pr+label:semver-minor)、[メジャー](https://github.com/facebook/react/pulls?q=is:open+is:pr+label:semver-major) バージョンのどれに該当するかによって決まります。数週間ごとにパッチバージョン、数ヶ月ごとにマイナーバージョン、そして年に 1、2 回メジャーバージョンをリリースします。重要な変更はすべて [changelog file](https://github.com/facebook/react/blob/master/CHANGELOG.md) に文書化されています。

source: ### Branch Organization {#branch-organization}
ja: ### ブランチの構成 {#branch-organization}

source: Submit all changes directly to the [`main branch`](https://github.com/facebook/react/tree/main).
ja: 私たちは [`master` branch](https://github.com/facebook/react/tree/master) を全てのテストが通るベストな状態に保つために努力しています。しかし素早い開発のため、あなたのアプリケーションと互換性がないかもしれない API の変更を行うことがあります。そのため [最新安定版の React](/downloads.html) を利用することをお勧めします。プルリクエストを送信する場合は、`master` ブランチに対して行ってください。私たちはメジャーバージョンの安定版ブランチを別々に管理していますが、それらへのプルリクエストは直接受け付けません。代わりに、master から最新の安定したメジャーバージョンへコードを壊さない cherry-pick を行います。

source: ### Feature Flags {#feature-flags}
ja: ### フィーチャー・フラグ (Feature Flags) {#feature-flags}

source: To keep the `main` branch in a releasable state, breaking changes and experimental features must be gated behind a feature flag.
ja: `master` ブランチをリリース可能な状態に保つため、破壊的な変更や実験的な機能はフィーチャー・フラグの背後で動作させます。

source: Feature flags are defined in [`packages/shared/ReactFeatureFlags.js`](https://github.com/facebook/react/blob/main/packages/shared/ReactFeatureFlags.js).
ja: フィーチャー・フラグは [`packages/shared/ReactFeatureFlags.js`](https://github.com/facebook/react/blob/master/packages/shared/ReactFeatureFlags.js) で定義されています。

source: Some builds of React may enable different sets of feature flags; for example, the React Native build may be configured differently than React DOM. These flags are found in [`packages/shared/forks`](https://github.com/facebook/react/tree/main/packages/shared/forks).
ja: React のいくつかのビルドでは別のフィーチャー・フラグを有効化していることがあります。例えば React Native のビルドは React DOM とは別に設定されているかもしれません。そのようなフラグは [`packages/shared/forks`](https://github.com/facebook/react/tree/master/packages/shared/forks) にあります。

source: Feature flags are statically typed by Flow, so you can run `yarn flow` to confirm that you've updated all the necessary files.
ja: フィーチャー・フラグは Flow で静的に型付けされているため `yarn flow` を実行することで必要なフラグを更新したことを確認できます。

source: React's build system will strip out disabled feature branches before publishing.
ja: React のビルドシステムが、無効化されている機能を公開前に取り除きます。

source: A continuous integration job runs on every commit to check for changes in bundle size.
ja: すべてのコミットについて継続的インテグレーションのジョブが実行され、バンドルサイズの変化を確認します。

source: You can use the change in size as a signal that a feature was gated correctly.
ja: このサイズの変化の情報を使って、ある機能が正しくフラグ管理されていることを確認することが可能です。

source: ### Bugs {#bugs}
ja: ### バグ {#bugs}

source: #### Where to Find Known Issues {#where-to-find-known-issues}
ja: #### 既知の問題を知るには {#where-to-find-known-issues}

source: We are using [GitHub Issues](https://github.com/facebook/react/issues) for our public bugs.
ja: 私たちは公開されるバグの管理に [GitHub Issues](https://github.com/facebook/react/issues) を使用しています。

source: We keep a close eye on this and try to make it clear when we have an internal fix in progress.
ja: 私たちはこれを注意深く見守り、修正中の作業がある場合はそれを明確にするようにします。

source: Before filing a new task, try to make sure your problem doesn't already exist.
ja: 新しい Issue を提出する前に、既に同じものが存在しないか確かめてください。

source: #### Reporting New Issues {#reporting-new-issues}
ja: #### 新しい問題の報告 {#reporting-new-issues}

source: The best way to get your bug fixed is to provide a reduced test case.
ja: バグを修正するための最善の方法は、バグを再現する最小のテストケースを提供することです。

source: This [JSFiddle template](https://jsfiddle.net/Luktwrdm/) is a great starting point.
ja: この [JSFiddle テンプレート](https://jsfiddle.net/Luktwrdm/) は素晴らしい出発点です。

source: #### Security Bugs {#security-bugs}
ja: #### セキュリティバグ {#security-bugs}

source: Facebook has a [bounty program](https://www.facebook.com/whitehat/) for the safe disclosure of security bugs.
ja: Facebook にはセキュリティバグの安全な開示のための[報奨金制度](https://www.facebook.com/whitehat/)が存在します。

source: With that in mind, please do not file public issues; go through the process outlined on that page.
ja: それを念頭において、セキュリティバグは公開の Issues に提出せず、上記のページの手順に従ってください。

source: ### How to Get in Touch {#how-to-get-in-touch}
ja: ### 連絡方法 {#how-to-get-in-touch}

source: * IRC: [#reactjs on freenode](https://webchat.freenode.net/?channels=reactjs) * [Discussion forums](/community/support.html#popular-discussion-forums)
ja: * IRC：[# freenode の reactjs](https://webchat.freenode.net/?channels=reactjs) * [ディスカッションフォーラム](/community/support.html#popular-discussion-forums)

source: There is also [an active community of React users on the Discord chat platform](https://www.reactiflux.com/) in case you need help with React.
ja: また、React に関して助けが必要な場合は、[Discord 上の React コミュニティ](http://www.reactiflux.com/)も存在します。

source: ### Proposing a Change {#proposing-a-change}
ja: ### 変更の提案 {#proposing-a-change}

source: If you intend to change the public API, or make any non-trivial changes to the implementation, we recommend [filing an issue](https://github.com/facebook/react/issues/new).
ja: もしあなたがパブリック API に変更を加えたり、実装に些細とはいえない変更を加えたりしたい場合、[Issue を提出する](https://github.com/facebook/react/issues/new)ことをお勧めします。

source: This lets us reach an agreement on your proposal before you put significant effort into it.
ja: これによって、あなたが大きな労力を割く前に提案について合意に達することができます。

source: If you're only fixing a bug, it's fine to submit a pull request right away but we still recommend to file an issue detailing what you're fixing.
ja: バグを修正するだけの場合は、すぐにプルリクエストを送信しても問題ありませんが、修正したいバグの内容を詳細に記載した Issue を提出することをお勧めします。

source: This is helpful in case we don't accept that specific fix but want to keep track of the issue.
ja: これは、あなたの修正自体は受け付けないがバグの追跡はしたいという場合に役立ちます。

source: ### Your First Pull Request {#your-first-pull-request}
ja: ### 初めてのプルリクエスト {#your-first-pull-request}

source: Working on your first Pull Request?
ja: はじめてのプルリクエストに取り組んでみますか？

source: You can learn how from this free video series:
ja: この無料ビデオシリーズから手順を学ぶことができます：

source: **[How to Contribute to an Open Source Project on GitHub](https://app.egghead.io/courses/how-to-contribute-to-an-open-source-project-on-github)**
ja: **[GitHub でオープンソースプロジェクトに貢献する方法](https://app.egghead.io/courses/how-to-contribute-to-an-open-source-project-on-github)**

source: To help you get your feet wet and get you familiar with our contribution process, we have a list of **[good first issues](https://github.com/facebook/react/issues?q=is:open+is:issue+label:"good+first+issue")** that contain bugs that have a relatively limited scope.
ja: あなたが新しい試みをする上で、貢献プロセスに慣れるのを助けるために、私たちは比較的影響範囲の少ないバグを含む **[good first issues](https://github.com/facebook/react/issues?q=is:open+is:issue+label:"good+first+issue")** のリストを持っています。

source: This is a great place to get started.
ja: これはオープンソースプロジェクトへの貢献の入門に最適です。

source: If you decide to fix an issue, please be sure to check the comment thread in case somebody is already working on a fix.
ja: Issue を解決することにした場合、誰かがすでに修正に取り組んでいる場合に備えて、コメントスレッドを必ず確認してください。

source: If nobody is working on it at the moment, please leave a comment stating that you intend to work on it so other people don't accidentally duplicate your effort.
ja: 現時点で誰も作業していない場合は、他の人が誤って重複して作業をしないように、作業する予定であることを示すコメントを残してください。

source: If somebody claims an issue but doesn't follow up for more than two weeks, it's fine to take it over but you should still leave a comment.
ja: 誰かが取り組むと宣言した Issue が 2 週間以上放置されている場合、それを引き継ぐことは問題ありませんが、その場合もコメントを残すべきです。

source: ### Sending a Pull Request {#sending-a-pull-request}
ja: ### プルリクエストを送信する {#sending-a-pull-request}

source: The core team is monitoring for pull requests.
ja: コアチームはプルリクエストを監視しています。

source: We will review your pull request and either merge it, request changes to it, or close it with an explanation.
ja: プルリクエストをレビューしてマージするか、変更を要求するか、説明付きでクローズします。

source: For API changes we may need to fix our internal uses at Facebook.com, which could cause some delay.
ja: Facebook.com 内部で使用法の検討が必要な可能性のある API の変更については、対応が遅くなることがあります。

source: We'll do our best to provide updates and feedback throughout the process.
ja: プロセス全体を通して最新情報とフィードバックを提供するよう最善を尽くします。

source: **Before submitting a pull request,** please make sure the following is done:
ja: **プルリクエストを送信する前に、**以下のプロセスが行われているか確認してください：

source: Fork [the repository](https://github.com/facebook/react) and create your branch from `main`.
ja: [リポジトリ](https://github.com/facebook/react) をフォークして `master` から新しいブランチを作成します。

source: Run `yarn` in the repository root.
ja: `yarn` コマンドをリポジトリルートで実行します。

source: If you've fixed a bug or added code that should be tested, add tests!
ja: バグを修正したり、テストが必要なコードを追加した場合は、テストを追加します。

source: Ensure the test suite passes (`yarn test`).
ja: テストスイートが通ることを確認してください (`yarn test`)。

source: Tip: `yarn test --watch TestName` is helpful in development.
ja: ヒント： `yarn test --watch TestName` コマンドは開発時に役立ちます。

source: Run `yarn test --prod` to test in the production environment.
ja: 本番環境でテストするために `yarn test --prod` コマンドを実行します。

source: If you need a debugger, run `yarn debug-test --watch TestName`, open `chrome://inspect`, and press "Inspect".
ja: デバッガが必要な場合は `yarn debug-test --watch TestName` を実行し `chrome://inspect` を開き "Inspect" を押してください。

source: Format your code with [prettier](https://github.com/prettier/prettier) (`yarn prettier`).
ja: [prettier](https://github.com/prettier/prettier) でコードをフォーマットします (`yarn prettier`)。

source: Make sure your code lints (`yarn lint`).
ja: リントを行います (`yarn lint`)。

source: Tip: `yarn linc` to only check changed files.
ja: ヒント： `yarn linc` は変更されたファイルのみに適用できます。

source: Run the [Flow](https://flowtype.org/) typechecks (`yarn flow`).
ja: [Flow](https://flowtype.org/) による型チェックを行います (`yarn flow`)。

source: If you haven't already, complete the CLA.
ja: まだの場合は、先に CLA (Contributor License Agreement) の提出を済ませます。

source: In order to accept your pull request, we need you to submit a CLA.
ja: あなたのプルリクエストを受け付けるために、Contributor License Agreement (CLA) の提出を行って頂く必要があります。

source: You only need to do this once, so if you've done this for another Facebook open source project, you're good to go.
ja: これは一度だけ行えば良いので、あなたが他の Facebook オープンソースプロジェクトで既に完了させている場合は必要ありません。

source: If you are submitting a pull request for the first time, just let us know that you have completed the CLA and we can cross-check with your GitHub username.
ja: 初めてプルリクエストを送信する場合は、CLA 提出を完了させたことをお知らせください。そうすれば私たちは GitHub のユーザ名と照らし合わせてチェックを行います。

source: **[Complete your CLA here.](https://code.facebook.com/cla)**
ja: **[ここで CLA を完了させてください。](https://code.facebook.com/cla)**

source: ### Contribution Prerequisites {#contribution-prerequisites}
ja: ### 貢献の前提条件 {#contribution-prerequisites}

source: * You have [Node](https://nodejs.org) installed at v8.0.0+ and [Yarn](https://yarnpkg.com/en/) at v1.2.0+.
ja: * [Node](https://nodejs.org) v8.0.0+ と、[Yarn](https://yarnpkg.com/en/) v1.2.0+ がインストールされていること。

source: * You have [JDK](https://www.oracle.com/technetwork/java/javase/downloads/index.html) installed.
ja: * [JDK](https://www.oracle.com/technetwork/java/javase/downloads/index.html) がインストールされていること。

source: * You have `gcc` installed or are comfortable installing a compiler if needed.
ja: * `gcc` がインストールされている、または必要に応じたコンパイラをインストールすることができること。

source: Some of our dependencies may require a compilation step.
ja: 依存関係の中にはコンパイルステップが必要なものもあります。

source: On OS X, the Xcode Command Line Tools will cover this.
ja: OS X では Xcode のコマンドラインツールが役立つでしょう。

source: On Ubuntu, `apt-get install build-essential` will install the required packages.
ja: Ubuntu では `apt-get install build-essential` コマンドで必要なパッケージをインストールできます。

source: Similar commands should work on other Linux distros.
ja: 他の Linux ディストリビューションでも似たようなコマンドで実現できるでしょう。

source: Windows will require some additional steps, see the [`node-gyp` installation instructions](https://github.com/nodejs/node-gyp#installation) for details.
ja: Windows では追加の手順が必要になり、詳しくは [`node-gyp` installation instructions](https://github.com/nodejs/node-gyp#installation) を参照してください。

source: * You are familiar with Git.
ja: * Git について精通していること。

source: ### Development Workflow {#development-workflow}
ja: ### 開発ワークフロー {#development-workflow}

source: After cloning React, run `yarn` to fetch its dependencies.
ja: React リポジトリをクローンしたあと、`yarn` コマンドで依存関係のパッケージを取得してください。

source: Then, you can run several commands:
ja: そうすれば、いくつかのコマンドが実行可能になります：

source: * `yarn lint` checks the code style.
ja: * `yarn lint` コードスタイルをチェックします。

source: * `yarn linc` is like `yarn lint` but faster because it only checks files that differ in your branch.
ja: * `yarn linc` `yarn lint` と似ていますが、変更されたファイルのみをチェックするのでこちらの方が速いです。

source: * `yarn test` runs the complete test suite.
ja: * `yarn test` 全てのテストスイートを実行します。

source: * `yarn test --watch` runs an interactive test watcher.
ja: * `yarn test --watch` 対話式のテストウォッチャーを実行します。

source: * `yarn test --prod` runs tests in the production environment.
ja: * `yarn test <pattern>` 指定したパターンにマッチするファイルのみテストを実行します。

source: * `yarn test <pattern>` runs tests with matching filenames.
ja: * `yarn test --prod` 本番環境でテストを実行します。

source: * `yarn debug-test` is just like `yarn test` but with a debugger.
ja: * `yarn debug-test` は `yarn test` に似ていますがデバッガ付きです。

source: Open `chrome://inspect` and press "Inspect".
ja: `chrome://inspect` を開き "Inspect" を押してください。

source: * `yarn flow` runs the [Flow](https://flowtype.org/) typechecks.
ja: * `yarn flow` [Flow](https://flowtype.org/) による型チェックを行います。

source: * `yarn build` creates a `build` folder with all the packages.
ja: * `yarn build` 全てのパッケージを含む `build` フォルダを作成します。

source: * `yarn build react/index,react-dom/index --type=UMD` creates UMD builds of just React and ReactDOM.
ja: * `yarn build react/index,react-dom/index --type=UMD` React と ReactDOM だけの UMD ビルドを作成します。

source: We recommend running `yarn test` (or its variations above) to make sure you don't introduce any regressions as you work on your change.
ja: `yarn test`（またはそれに近い上記のコマンド）を実行し、あなたの行った変更によって何らかの異常を引き起こしていないか確認することをお勧めします。

source: However, it can be handy to try your build of React in a real project.
ja: とはいえ実際のプロジェクトで自分の React のビルドを使ってみることも役に立つでしょう。

source: First, run `yarn build`.
ja: まず `yarn build` を実行します。

source: This will produce pre-built bundles in `build` folder, as well as prepare npm packages inside `build/packages`.
ja: これによってビルド済みのバンドルファイルが `build` フォルダ内に作られ、同時に `build/packages` 内に npm パッケージも用意されます。

source: The easiest way to try your changes is to run `yarn build react/index,react-dom/index --type=UMD` and then open `fixtures/packaging/babel-standalone/dev.html`.
ja: 変更を試す一番簡単な方法は `yarn build react/index,react-dom/index --type=UMD` を実行し、`fixtures/packaging/babel-standalone/dev.html` を開くことです。

source: This file already uses `react.development.js` from the `build` folder so it will pick up your changes.
ja: このファイルは `build` フォルダの `react.development.js` を既に使用しているので、変更が反映されます。

source: If you want to try your changes in your existing React project, you may copy `build/node_modules/react/umd/react.development.js`, `build/node_modules/react-dom/umd/react-dom.development.js`, or any other build products into your app and use them instead of the stable version.
ja: あなたの加えた変更を既存の React プロジェクトで試したい場合、`build/node_modules/react/umd/react.development.js`、`build/node_modules/react-dom/umd/react-dom.development.js`、もしくは他のビルドされたファイルをあなたのアプリケーションにコピーして安定版の代わりに使用することができます。

source: If your project uses React from npm, you may delete `react` and `react-dom` in its dependencies and use `yarn link` to point them to your local `build` folder.
ja: もし、npm 版の React を使用している場合は `react` と `react-dom` を依存関係から削除し、`yarn link` を使用してそれらがローカルの `build` フォルダを指すようにしてください。

source: Note that **instead of `--type=UMD` you'll want to pass `--type=NODE` when building**.
ja: ビルド時には **`--type=UMD` の代わりに `--type=NODE` を渡す必要があることに注意してください**。

source: You'll also need to build the `scheduler` package:
ja: また `scheduler` パッケージもビルドする必要があります：

source: Every time you run `yarn build` in the React folder, the updated versions will appear in your project's `node_modules`.
ja: `yarn build` を React フォルダで実行するたびに、あなたのプロジェクトの `node_modules` フォルダに更新されたバージョンが現れるでしょう。

source: You can then rebuild your project to try your changes.
ja: その後、プロジェクトをビルドし直して変更を試すことができます。

source: If some package is still missing (e.g. maybe you use `react-dom/server` in your project), you can always do a full build with `yarn build`.
ja: もしまだいくつかのパッケージが不足している場合（例えばプロジェクトで `react-dom/server` を使っている場合）、常に `yarn build` でフルのビルドを行うことができます。

source: Note that running `yarn build` without options takes a long time.
ja: ただしオプションなしの `yarn build` は時間がかかることに注意してください。

source: We still require that your pull request contains unit tests for any new functionality.
ja: プルリクエストにあなたの新機能に応じたユニットテストを含めることは必須です。

source: This way we can ensure that we don't break your code in the future.
ja: これによって将来あなたのコードを壊してしまわないことが担保されます。

source: ### Style Guide {#style-guide}
ja: ### スタイルガイド {#style-guide}

source: We use an automatic code formatter called [Prettier](https://prettier.io/).
ja: [Prettier](https://prettier.io/) と呼ばれる自動コードフォーマッタを使います。

source: Run `yarn prettier` after making any changes to the code.
ja: `yarn prettier` コマンドをコードを変更した後に実行してください。

source: Then, our linter will catch most issues that may exist in your code.
ja: そうすれば、後はリンターがあなたのコードに存在するほとんどの問題を捕らえるでしょう。

source: You can check the status of your code styling by simply running `yarn linc`.
ja: 自分の書いたコードのスタイルをチェックしたい場合は単に `yarn linc` を実行してください。

source: However, there are still some styles that the linter cannot pick up.
ja: しかしながら、リンターでもチェックしきれないいくつかのスタイルがあります。

source: If you are unsure about something, looking at [Airbnb's Style Guide](https://github.com/airbnb/javascript) will guide you in the right direction.
ja: 何か分からないことがあれば [Airbnb's Style Guide](https://github.com/airbnb/javascript) が正しい方向に導いてくれるでしょう。

source: Many changes, including bug fixes and documentation improvements can be implemented and reviewed via the normal GitHub pull request workflow.
ja: バグ修正やドキュメンテーションの改善を含む多くの変更は、通常の GitHub プルリクエストのワークフローを通して行われレビューされます。

source: Some changes though are "substantial", and we ask that these be put through a bit of a design process and produce a consensus among the React core team.
ja: ただし、いくつかの "大きめの" 変更は、多少の設計プロセスと React コアチームの合意を経ることをお願いします。

source: The "RFC" (request for comments) process is intended to provide a consistent and controlled path for new features to enter the project.
ja: "RFC" (request for comments) プロセスは、新機能がプロジェクトに取り込まれるまでの一貫性があり整備された筋道を提供することを目的としています。

source: You can contribute by visiting the [rfcs repository](https://github.com/reactjs/rfcs).
ja: [rfcs リポジトリ](https://github.com/reactjs/rfcs) を訪れれば貢献することができます。

source: ### License {#license}
ja: ### ライセンス {#license}

source: By contributing to React, you agree that your contributions will be licensed under its MIT license.
ja: React に貢献するにあたって、あなたの貢献は MIT ライセンスの元にあることに同意したとみなします。

source: ### What Next? {#what-next}
ja: ### 次のセクション {#what-next}

source: Read the [next section](/docs/codebase-overview.html) to learn how the codebase is organized.
ja: [次のセクション](/docs/codebase-overview.html) を読んで、コードベースの構成方法について知ることができます。
